wikimedia/smash-pig/Tests/SoapInjector/orders.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">2798</value>
						</amount>
						<eventCode>ORDER_OPENED</eventCode>
						<eventDate>2012-12-14T20:45:35.062+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod xsi:nil="true"/>
						<pspReference>testnotification_ORDER_OPENED</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">2500</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.062+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>sms</paymentMethod>
						<pspReference>testnotification1_AUTHORISATION</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">298</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2012-12-14T20:45:35.062+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>ideal</paymentMethod>
						<pspReference>testnotification1_AUTHORISATION</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">2798</value>
						</amount>
						<eventCode>ORDER_CLOSED</eventCode>
						<eventDate>2012-12-14T20:45:35.062+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod xsi:nil="true"/>
						<pspReference>testnotification_ORDER_CLOSED</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
